In [1]:
from pandas import DataFrame

<h1 style="color:green;">Create DataFrame</h1>

In [2]:
data = {'Name': ['John', 'Tim', 'Rob'],
        'Age': [34, 23, 42],
        'Salary': [4500, 2300, 5800]
        }
frame = DataFrame(data)

In [3]:
frame

   Name  Age  Salary
0  John   34    4500
1   Tim   23    2300
2   Rob   42    5800

In [4]:
frame['Salary']

0    4500
1    2300
2    5800
Name: Salary, dtype: int64

In [5]:
frame.loc[2]

Name       Rob
Age         42
Salary    5800
Name: 2, dtype: object

<h1 style="color:green;">Changing columns</h1>

In [6]:
new_frame = DataFrame(data, columns=['Age', 'Name', 'Salary', 'Profile'])
new_frame

   Age  Name  Salary Profile
0   34  John    4500     NaN
1   23   Tim    2300     NaN
2   42   Rob    5800     NaN

In [7]:
new_frame['Profile'] = 'Doctor'
new_frame

   Age  Name  Salary Profile
0   34  John    4500  Doctor
1   23   Tim    2300  Doctor
2   42   Rob    5800  Doctor

In [8]:
new_frame['Education'] = 'MS'
new_frame

   Age  Name  Salary Profile Education
0   34  John    4500  Doctor        MS
1   23   Tim    2300  Doctor        MS
2   42   Rob    5800  Doctor        MS

In [9]:
new_frame.T

                0       1       2
Age            34      23      42
Name         John     Tim     Rob
Salary       4500    2300    5800
Profile    Doctor  Doctor  Doctor
Education      MS      MS      MS

<h1 style="color:green;">Reindexing</h1>

In [10]:
frame

   Name  Age  Salary
0  John   34    4500
1   Tim   23    2300
2   Rob   42    5800

In [11]:
frame.reindex([2, 1, 0])

   Name  Age  Salary
2   Rob   42    5800
1   Tim   23    2300
0  John   34    4500

In [12]:
frame.reindex(columns=['Age', 'Name', 'Salary'])

   Age  Name  Salary
0   34  John    4500
1   23   Tim    2300
2   42   Rob    5800

<h1 style="color:green;">Deleting cows & columns</h1>

In [13]:
frame

   Name  Age  Salary
0  John   34    4500
1   Tim   23    2300
2   Rob   42    5800

In [14]:
frame.drop([0, 1])

  Name  Age  Salary
2  Rob   42    5800

In [15]:
frame.drop('Age', axis=1)

   Name  Salary
0  John    4500
1   Tim    2300
2   Rob    5800